Bhavya-Saravanan/BLE-Firmware-EFR32BG/src/ble.c
/***********************************************************************
 * @file      ble.c
 * @version   1.0
 * @brief     Implementation file for Bluetooth Low Energy (BLE) communication.
 *
 * This file contains functions for initializing BLE, handling BLE events,
 * sending temperature notifications, and formatting temperature values
 * in IEEE-11073 format.
 *
 * @author    Bhavya Saravanan
 * @date      13-03-2025
 *
 * @institution University of Colorado Boulder (UCB)
 * @course     ECEN 5823: IoT Embedded Firmware
 * @instructor Chris Choi
 *
 * @resources  Silicon Labs Bluetooth API, Lecture slides.
 ***********************************************************************/
#include "em_letimer.h"
#include "sl_bt_api.h"
#include "ble.h"
#include "gatt_db.h"
#include "sl_bt_api.h"
#include "sl_power_manager.h"
#include "i2c.h"
#define INCLUDE_LOG_DEBUG 1
#include "src/log.h"
#include <stdint.h>
#include "ble_device_type.h"
#include "lcd.h"
#include "timer.h"
#include "sl_bt_api.h"
#include <math.h>
#include"scheduler.h"
#include"gpio.h"
#include <string.h>
#include <stdbool.h>

// Variables for BLE connection parameters
uint16_t interval;
uint16_t latency;
uint16_t timeout;
// Declare circular buffer and pointers
uint32_t         wptr = 0;
uint32_t         rptr = 0;
bool             isflag = false;

#define SL_BT_SM_AUTHENTICATION_BONDING_FLAG 0x6F //Setting up the security manager configuration flag
#define QUEUE_DEPTH 16  // Circular buffer size
#define MAX_BUFFER_LENGTH 5


typedef struct {
    uint16_t charHandle;  // Characteristic handle
    size_t bufferLength;  // Length of data
    uint8_t buffer[MAX_BUFFER_LENGTH];  // Data buffer
} queue_struct_t;

// Structure to store BLE connection data
typedef struct {
    uint8_t connection_handle;
    bool bonded;
} ble_data_t;


// Global BLE data structure
static ble_data_struct_t ble_data;
static uint32_t pairing_passkey = 0;  // Stores the passkey for numeric comparison
static bool waiting_for_passkey_confirmation = false;  // Tracks if waiting for PB0 confirmation
static bool pb0_indication_in_flight = false;  // Tracks PB0 indication status
static queue_struct_t my_queue[QUEUE_DEPTH]; // Circular buffer
ble_data_t ble_datas = {0};
static bool pairing_in_progress = false;  // Track if pairing is ongoing

#define TEMPERATURE_BUFFER_SIZE 5  // Buffer size for temperature notifications
#define MANTISSA_MASK 0x00FFFFFF  // Mask for 24-bit mantissa
#define ADVERTISING_INTERVAL_MIN  400    // Minimum advertising interval (250ms * 1.6 = 400 units)
#define ADVERTISING_INTERVAL_MAX  400    // Maximum advertising interval (250ms * 1.6 = 400 units)
#define CONNECTION_INTERVAL_MIN   60     // Minimum connection interval (75ms / 1.25ms)
#define CONNECTION_INTERVAL_MAX   60     // Maximum connection interval (75ms / 1.25ms)
#define SLAVE_LATENCY             4      // Slave latency (300ms / 75ms)
#define SUPERVISION_TIMEOUT       76     // Supervision timeout
#define MIN_CONNECTION_LENGTH     0      // Minimum connection length
#define MAX_CONNECTION_LENGTH     65535  // Maximum connection length

/**
 * @brief     Returns a pointer to the BLE data structure.
 *
 * This function provides access to the global BLE data structure.
 *
 * @param     None
 * @return    Pointer to `ble_data_struct_t`
 */
ble_data_struct_t* getBleDataPtr() {
    return (&ble_data);
}

void  send_light_notification(float lux)
{
    uint8_t lux_buffer[2];
    lux_buffer[0] = (uint8_t)(lux & 0xFF);            // Low byte
    lux_buffer[1] = (uint8_t)((lux >> 8) & 0xFF);     // High byte

    // Step 1: Write to local GATT attribute
    sl_bt_gatt_server_write_attribute_value(
        gattdb_light_intensity,
        0,
        sizeof(lux_buffer),
        lux_buffer
    );

    // Step 2: Enqueue to send Indication
    write_queue(gattdb_light_intensity, lux_buffer, sizeof(lux_buffer));

    // Step 3: Try to send immediately if possible
    process_indications();

    // Step 4: Print to LCD if allowed
    if (bleDataPtr->connection_open && bleDataPtr->ok_to_send_htm_indications) {
        displayPrintf(DISPLAY_ROW_TEMPVALUE, "Lux: %d", lux);
    }


}


/**
 * @brief     Sends a temperature notification to the connected BLE client.
 *
 * This function formats the temperature value, writes it to the GATT database,
 * and sends an indication to the BLE client if allowed.
 *
 * @param     temperature_value  The temperature to send in degrees Celsius.
 * @return    None
 */
/*void send_temperature_notification(float temperature_value)
{
     sl_status_t sc;

     uint8_t htm_temperature_buffer[5] = {0}; // Buffer to store temperature data

     uint32_t temp = IEEEformating(temperature_value);
     // Populate the buffer with temperature data
     htm_temperature_buffer[0] = 0x00; // Flags: 0x00 for Celsius, no timestamp
     htm_temperature_buffer[1] = (uint8_t)(temp & 0xFF);
     htm_temperature_buffer[2] = (uint8_t)((temp >> 8) & 0xFF);
     htm_temperature_buffer[3] = (uint8_t)((temp >> 16) & 0xFF);
     htm_temperature_buffer[4] = (uint8_t)((temp >> 24) & 0xFF);

     sc = sl_bt_gatt_server_write_attribute_value(
            gattdb_temperature_measurement, 0, TEMPERATURE_BUFFER_SIZE, htm_temperature_buffer);

    if (sc != SL_STATUS_OK) {
        LOG_ERROR("Failed by writting to local database: 0x%x", sc);
    }

    // Send indication if connection is open and allowed
    if (ble_data.connection_open && ble_data.ok_to_send_htm_indications)
    {
        write_queue(gattdb_temperature_measurement, TEMPERATURE_BUFFER_SIZE, htm_temperature_buffer);
        process_indications();
        displayPrintf(DISPLAY_ROW_TEMPVALUE, "Temp = %.1f ",temperature_value);
    }

}*/
/**
 * @brief     Converts a temperature value to IEEE-11073 32-bit floating point format.
 *
 * This function scales the temperature, extracts the exponent and mantissa,
 * and packs them into an IEEE-11073 format.
 *
 * @param     temp_value  The temperature value in degrees Celsius.
 * @return    The formatted IEEE-11073 32-bit floating point value.
 */

/*uint32_t IEEEformating(float temp_value)
{
    union {
        struct {
            uint32_t mantissa : 24; // 24-bit mantissa field
            uint32_t exponent : 8;  // 8-bit exponent field
        };
        uint32_t ieee_value;
    } ieee_temp;

    ieee_temp.exponent = 0xFE; // Exponent for scaling (divide by 100)

    //  mantissa is positive and uses 24 bits
    int32_t scaled_mantissa = (int32_t)(temp_value * 100); // Scale temperature to 2 decimal places
    ieee_temp.mantissa = (uint32_t)(scaled_mantissa & MANTISSA_MASK);// Mask mantissa to 24 bits

