Bhavya-Saravanan/BLE-Firmware-EFR32BG/src/ble.c
    return ieee_temp.ieee_value;
}*/
/**
 * @brief     Converts IEEE-11073 formatted temperature data to Celsius.
 *
 * This function extracts the mantissa and exponent from a BLE characteristic value
 * formatted in IEEE-11073 format and converts it into a readable Celsius temperature.
 *
 * @param     buffer_ptr  Pointer to the raw temperature data buffer.
 * @return    Converted temperature value in degrees Celsius.
 */
/*float FLOAT_TO_CELSIUS(const uint8_t *buffer_ptr)
{
    // Extract the exponent (8-bit signed integer)
    int8_t exponent = (int8_t)buffer_ptr[4];

    // Extract the mantissa (24-bit signed integer)
    int32_t mantissa = (int32_t)(
        (buffer_ptr[1] << 0)  |
        (buffer_ptr[2] << 8)  |
        (buffer_ptr[3] << 16)
    );

    // Sign extend the mantissa if negative (check the sign bit)
    if (buffer_ptr[3] & 0x80) {
        mantissa |= 0xFF000000;  // Extend sign for 32-bit integer
    }

    // Compute the temperature in Celsius
    float temperature = mantissa * pow(10, exponent);

    return temperature;  // Return float value
}*/
/**
 * @brief     Initializes the BLE stack and sets up advertising.
 *
 * This function retrieves the Bluetooth address, creates an advertising set,
 * configures advertising parameters, and starts advertising.
 *
 * @param     None
 * @return    None
 */

void ble_init(void)
{
    sl_status_t sc;
    uint8_t initial_value = 0x00;
    // Get Bluetooth Address
    sc = sl_bt_system_get_identity_address(&ble_data.myAddress,&ble_data.myAddressType );
    if (sc != SL_STATUS_OK) {
        LOG_ERROR("Failed to get identity address: 0x%04X\n", sc);
    }
    else {

            displayPrintf(DISPLAY_ROW_BTADDR, "%02X:%02X:%02X:%02X:%02X:%02X",
                          ble_data.myAddress.addr[0],
                          ble_data.myAddress.addr[1],
                          ble_data.myAddress.addr[2],
                          ble_data.myAddress.addr[3],
                          ble_data.myAddress.addr[4],
                          ble_data.myAddress.addr[5]);
        }

    // Create an advertising set
    sc = sl_bt_advertiser_create_set(&ble_data.advertisingSetHandle);
    if (sc != SL_STATUS_OK) {
        LOG_ERROR("Failed to create advertiser set: 0x%04X\n", sc);
    }

    // Generate data for advertising (General Discoverable Mode)
    sc = sl_bt_legacy_advertiser_generate_data(ble_data.advertisingSetHandle,
                                               sl_bt_advertiser_general_discoverable);
    if (sc != SL_STATUS_OK) {
        LOG_ERROR("Failed to generate advertising data: 0x%04X\n", sc);
    }

    // Configure advertising interval to 250ms
    sc = sl_bt_advertiser_set_timing(ble_data.advertisingSetHandle,
                                     ADVERTISING_INTERVAL_MIN,  // Min interval
                                     ADVERTISING_INTERVAL_MAX,  // Max interval
                                     0, 0);  // Duration & max events (infinite advertising)

    if (sc != SL_STATUS_OK) {
        LOG_ERROR("Failed to set advertiser timing: 0x%04X\n", sc);
    }

    // Start advertising
    sc = sl_bt_legacy_advertiser_start(ble_data.advertisingSetHandle,
                                       sl_bt_advertiser_connectable_scannable);
    if (sc != SL_STATUS_OK) {
        LOG_ERROR("Failed to start advertising: 0x%04X\n", sc);
    }

    sl_status_t status = sl_bt_gatt_server_write_attribute_value(
        gattdb_button_state,  // GATT characteristic handle
        0,                    // Offset
        1,                    // Length
        &initial_value         // Data
    );

    if (status != SL_STATUS_OK) {
        LOG_ERROR("GATT Init Failed! Status: %d", status);
    }
    sl_bt_sm_delete_bondings();
    sl_bt_sm_configure(SL_BT_SM_AUTHENTICATION_BONDING_FLAG,
                       sl_bt_sm_io_capability_displayyesno);

}

/**
 * @brief : Handles Bluetooth events and updates system state.
 *  It distinguishes between the Client and Server roles
 * using the `DEVICE_IS_BLE_SERVER` macro and handles events accordingly.
 *
 * This function processes various BLE events such as connection, disconnection,
 * and GATT characteristic status updates.
 *
 * @param     evt  Pointer to the Bluetooth event structure.
 * @return    None
 */
void handle_ble_event(sl_bt_msg_t *evt)
{
  uint32_t signal;
 #if DEVICE_IS_BLE_SERVER
    sl_status_t sc;

    switch (SL_BT_MSG_ID(evt->header))
    {
        case sl_bt_evt_system_boot_id:
          displayInit();
          displayPrintf(DISPLAY_ROW_NAME, "%s", BLE_DEVICE_TYPE_STRING);
            ble_init();
            displayPrintf(DISPLAY_ROW_CONNECTION, "Advertising");
            displayPrintf(DISPLAY_ROW_ASSIGNMENT, "A8");
            displayPrintf(DISPLAY_ROW_9, "Button Released");
            break;

        case sl_bt_evt_connection_opened_id:

            displayPrintf(DISPLAY_ROW_CONNECTION, "Connected");
            // Update BLE connection state
            ble_data.connection_open = true;
            ble_data.ok_to_send_htm_indications = false;
            ble_data.indication_in_flight = false;
            ble_data.connection_handle = evt->data.evt_connection_opened.connection;

            // Set connection parameters as per the assignment requirements:
            sc = sl_bt_connection_set_parameters(
                ble_data.connection_handle,      // Connection handle
                CONNECTION_INTERVAL_MIN,         // Min connection interval
                CONNECTION_INTERVAL_MAX,         // Max connection interval
                SLAVE_LATENCY,                   // Slave latency
                SUPERVISION_TIMEOUT,             // Supervision timeout
                MIN_CONNECTION_LENGTH,           // Min connection length
                MAX_CONNECTION_LENGTH            // Max connection length
            );
            if (sc != SL_STATUS_OK) {
                LOG_ERROR("Failed to set connection parameters: 0x%04X\n", sc);
            }

            break;


        case sl_bt_evt_connection_closed_id:
            displayPrintf(DISPLAY_ROW_CONNECTION, "Advertising");
            ble_data.connection_open = false;
            ble_data.ok_to_send_htm_indications = false;
            ble_data.indication_in_flight = false;
            gpioLed1SetOff();
            gpioLed0SetOff();
            // Generate new advertising data
            sc = sl_bt_legacy_advertiser_generate_data(ble_data.advertisingSetHandle,
                                                       sl_bt_advertiser_general_discoverable);
            if (sc != SL_STATUS_OK) {
                LOG_ERROR("Failed to generate advertising data: 0x%04X\n", sc);

