Bhavya-Saravanan/BLE-Firmware-EFR32BG/src/ble.c
            }

            // Restart advertising after client has disconnected
            sc = sl_bt_legacy_advertiser_start(ble_data.advertisingSetHandle,
                                               sl_bt_advertiser_connectable_scannable);

            if (sc != SL_STATUS_OK) {
                LOG_ERROR("Failed to restart advertising: 0x%04X\n", sc);
            }
            displayPrintf(DISPLAY_ROW_TEMPVALUE, " ");
            reset_queue();
            sl_bt_sm_delete_bondings();
            break;


        /*case sl_bt_evt_connection_parameters_id:

          interval = evt->data.evt_connection_parameters.interval;
          latency = evt->data.evt_connection_parameters.latency;
          timeout = evt->data.evt_connection_parameters.timeout;
          LOG_INFO("\r\nInterval:%d ms", (interval * 125) / 100);
          LOG_INFO("\r\nLatency: %d ", latency);
          LOG_INFO("\r\nSupervision Timeout: %d ms",timeout / 10);

          break;*/

        case sl_bt_evt_gatt_server_characteristic_status_id:
            if (evt->data.evt_gatt_server_characteristic_status.status_flags == sl_bt_gatt_server_client_config) {
                if (evt->data.evt_gatt_server_characteristic_status.client_config_flags == sl_bt_gatt_indication) {

                    if (evt->data.evt_gatt_server_characteristic_status.characteristic == gattdb_light_intensity) {
                        // Enable HTM Indications
                        ble_data.ok_to_send_htm_indications = true;

                        // Initialize timers and I2C for temperature measurement
                        TimerInit();
                        i2c_init();

                        NVIC_ClearPendingIRQ(LETIMER0_IRQn);
                        NVIC_EnableIRQ(LETIMER0_IRQn);
                        gpioLed0SetOn();
                    }

             }
            else {
                if (evt->data.evt_gatt_server_characteristic_status.characteristic == gattdb_light_intensity) {
                    // Disable HTM Indications
                    displayPrintf(DISPLAY_ROW_TEMPVALUE, " ");
                    ble_data.indication_in_flight = false;
                    LETIMER_Enable(LETIMER0, false);
                    gpioLed0SetOff();
                }
                               }
            }
           else if (evt->data.evt_gatt_server_characteristic_status.status_flags == sl_bt_gatt_server_confirmation) {
                // Clear indication in-flight flag after confirmation
                ble_data.indication_in_flight = false;
                process_indications();
            }
            break;

        case sl_bt_evt_system_soft_timer_id:
           displayUpdate();
           break;

        case sl_bt_evt_gatt_server_indication_timeout_id:
          ble_data.indication_in_flight = false;
          break;

        case sl_bt_evt_sm_confirm_bonding_id:
          sl_bt_sm_bonding_confirm(evt->data.evt_sm_confirm_bonding.connection, 1);
          break;

        case sl_bt_evt_sm_confirm_passkey_id:
            pairing_passkey = evt->data.evt_sm_confirm_passkey.passkey;
            waiting_for_passkey_confirmation = true;

            displayPrintf(DISPLAY_ROW_PASSKEY, "Passkey: %06lu", pairing_passkey);
            displayPrintf(DISPLAY_ROW_ACTION, "Confirm with PB0");
            break;


        case sl_bt_evt_sm_bonded_id:
            ble_datas.bonded = true;
            waiting_for_passkey_confirmation = false;
            displayPrintf(DISPLAY_ROW_CONNECTION, "Bonded");
            displayPrintf(DISPLAY_ROW_PASSKEY,  " ");
            displayPrintf(DISPLAY_ROW_ACTION, " ");
            break;

        case sl_bt_evt_sm_bonding_failed_id:
            pairing_passkey = 0;
            sl_bt_sm_delete_bondings();
            waiting_for_passkey_confirmation = false;
            displayPrintf(DISPLAY_ROW_CONNECTION, "Bonding Failed");
            break;

       case sl_bt_evt_system_external_signal_id:
           // Extract external signal
           signal = evt->data.evt_system_external_signal.extsignals;

           if (signal & PB0_EVENT) {
               if (waiting_for_passkey_confirmation) {
                   sl_bt_sm_passkey_confirm(ble_data.connection_handle, 1); // Confirm pairing
                   waiting_for_passkey_confirmation = false;
               } else {
                   uint8_t button_value = 0x01;
                   sl_bt_gatt_server_write_attribute_value(gattdb_button_state, 0, 1, &button_value);

                   if (ble_datas.bonded) { // Send indication only if bonded
                       write_queue(gattdb_button_state, 1, &button_value);
                       process_indications();
                   }
                   displayPrintf(DISPLAY_ROW_9, "Button Pressed");
               }
           }

           if (signal & PB0_RELEASED) {
               uint8_t button_value = 0x00;
               sl_bt_gatt_server_write_attribute_value(gattdb_button_state, 0, 1, &button_value);

               if (ble_datas.bonded) { // Send indication only if bonded
                   write_queue(gattdb_button_state, 1, &button_value);
                   process_indications();
               }
               displayPrintf(DISPLAY_ROW_9, "Button Released");
           }
           break;

        default:
            break;
    }
#else
   sl_status_t sc;

switch (SL_BT_MSG_ID(evt->header))
{
  case sl_bt_evt_system_boot_id:

    displayInit();
    displayPrintf(DISPLAY_ROW_ASSIGNMENT, "A7");
    displayPrintf(DISPLAY_ROW_NAME, "Client");
    // Get Bluetooth Address
      sc = sl_bt_system_get_identity_address(&ble_data.myAddress,&ble_data.myAddressType );
      if (sc != SL_STATUS_OK) {
          LOG_ERROR("Failed to get identity address: 0x%04X\n", sc);
      }
      else {

              displayPrintf(DISPLAY_ROW_BTADDR, "%02X:%02X:%02X:%02X:%02X:%02X",
                            ble_data.myAddress.addr[0],
                            ble_data.myAddress.addr[1],
                            ble_data.myAddress.addr[2],
                            ble_data.myAddress.addr[3],
                            ble_data.myAddress.addr[4],
                            ble_data.myAddress.addr[5]);
          }

    displayPrintf(DISPLAY_ROW_CONNECTION, "Discovering");
    // Set the default connection parameters
    sc = sl_bt_connection_set_default_parameters(
        60,  // Minimum connection interval (in units of 1.25ms) → 60 * 1.25ms = 75ms
        60,  // Maximum connection interval (in units of 1.25ms) → 60 * 1.25ms = 75ms
        4,   // Slave latency → Number of connection intervals a slave can skip if no data is exchanged
        83,  // Supervision timeout (in units of 10ms) → 83 * 10ms = 830ms/10
        0,   // Minimum CE length (unused, typically 0)
        4    // Maximum CE length (unused, typically set to 4)
    );

      if (sc != SL_STATUS_OK) {
          LOG_ERROR("Failed to set connection parameters, error: 0x%04X\n", sc);
      }

      // Configure BLE scanner parameters
      sc = sl_bt_scanner_set_parameters(
          1,   // Scan mode: 1 → Passive scanning
          80,  // Scan interval
          40   // Scan window
      );
      if (sc != SL_STATUS_OK) {
                LOG_ERROR("Failed to set scanner parameters, error: 0x%04X\n", sc);
      }
      sl_bt_sm_delete_bondings();
      sl_bt_sm_configure(0x0F, sl_bt_sm_io_capability_displayyesno);
      sc |= sl_bt_scanner_start(sl_bt_gap_phy_1m, sl_bt_scanner_discover_generic);

      if (sc != SL_STATUS_OK) {
          LOG_ERROR("Failed to start scanning, error: 0x%04X\n", sc);
      }

      break;

  case sl_bt_evt_scanner_legacy_advertisement_report_id:
  {
      bd_addr server_address = SERVER_BT_ADDRESS;

