Bhavya-Saravanan/BLE-Firmware-EFR32BG/src/ble.c
      // Extract advertisement event flags
      uint8_t adv_flags = evt->data.evt_scanner_legacy_advertisement_report.event_flags;

      // Check if the advertisement is connectable before proceeding
      if (adv_flags & 0x03) {
          if (memcmp(evt->data.evt_scanner_legacy_advertisement_report.address.addr,
                     server_address.addr, sizeof(bd_addr)) == 0) {

              sl_bt_scanner_stop();
              sc = sl_bt_connection_open(
                  evt->data.evt_scanner_legacy_advertisement_report.address,
                  evt->data.evt_scanner_legacy_advertisement_report.address_type,
                  sl_bt_gap_phy_1m,
                  &ble_data.connection_handle
              );

              if (sc == SL_STATUS_OK) {
                  // Print the connected server address on row DISPLAY_ROW_BTADDR2
                  displayPrintf(DISPLAY_ROW_BTADDR2, "%02X:%02X:%02X:%02X:%02X:%02X",
                                server_address.addr[0], server_address.addr[1],
                                server_address.addr[2], server_address.addr[3],
                                server_address.addr[4], server_address.addr[5]);
              } else {
                  LOG_ERROR("Failed to open connection, error: 0x%04X\n", sc);
              }
          }
      }
  }
  break;


  case sl_bt_evt_connection_opened_id:

    displayPrintf(DISPLAY_ROW_CONNECTION, "Connected");


      // Storing  connection handle
      ble_data.connection_handle = evt->data.evt_connection_opened.connection;


      break;



  case sl_bt_evt_gatt_service_id:

  // Checking if the discovered service is Health Thermometer (0x1809)
    if (evt->data.evt_gatt_service.uuid.len == 2) {  // UUID should be 16-bit (2 bytes)
      uint16_t service_uuid = (evt->data.evt_gatt_service.uuid.data[1] << 8) |
                               evt->data.evt_gatt_service.uuid.data[0];

     if (service_uuid == HEALTH_THERMOMETER_SERVICE_UUID) {
      // Storing the service handle
      ble_data.received_service_handle = evt->data.evt_gatt_service.service;
          }
      }

  break;


  case sl_bt_evt_system_external_signal_id:
      // 🔹 Step 3: If PB1 was pressed, attempt to read `button_state`
      if (evt->data.evt_system_external_signal.extsignals & PB1_EVENT_PRESSED) {
          if (!pairing_in_progress) {
              sl_bt_gatt_read_characteristic_value(ble_data.connection_handle, gattdb_button_state);
          }
      }

      // 🔹 Step 4: If PB0 is pressed for pairing confirmation
      if ((evt->data.evt_system_external_signal.extsignals & PB0_EVENT_PRESSED) && waiting_for_passkey_confirmation) {
          sl_bt_sm_passkey_confirm(ble_data.connection_handle, 1);
          waiting_for_passkey_confirmation = false;
          displayPrintf(DISPLAY_ROW_PASSKEY, "");
          displayPrintf(DISPLAY_ROW_ACTION, "");
      }
      break;

  case sl_bt_evt_gatt_procedure_completed_id:
      // 🔹 Step 5: If read fails with encryption error, start bonding
      if (evt->data.evt_gatt_procedure_completed.result == SL_STATUS_BT_ATT_INSUFFICIENT_ENCRYPTION) {
          if (!pairing_in_progress) {
              pairing_in_progress = true;
              sl_bt_sm_increase_security(ble_data.connection_handle);
          }
      }
      break;

  case sl_bt_evt_sm_confirm_passkey_id:
      // 🔹 Step 6: Display passkey and wait for PB0 confirmation
      pairing_passkey = evt->data.evt_sm_confirm_passkey.passkey;
      displayPrintf(DISPLAY_ROW_PASSKEY, "Passkey: %06lu", pairing_passkey);
      displayPrintf(DISPLAY_ROW_ACTION, "Confirm with PB0");
      waiting_for_passkey_confirmation = true;
      break;

  case sl_bt_evt_sm_bonded_id:
      // 🔹 Step 7: Bonding successful, retry reading `button_state`
      pairing_in_progress = false;
      waiting_for_passkey_confirmation = false;
      displayPrintf(DISPLAY_ROW_CONNECTION, "Bonded");
      sl_bt_gatt_read_characteristic_value(ble_data.connection_handle, gattdb_button_state);
      break;

  case sl_bt_evt_gatt_characteristic_id:
     if (evt->data.evt_gatt_characteristic.uuid.len == 2) {  // UUID should be 16-bit (2 bytes)
        uint16_t char_uuid = (evt->data.evt_gatt_characteristic.uuid.data[1] << 8) |
                              evt->data.evt_gatt_characteristic.uuid.data[0];

     if (char_uuid == TEMPERATURE_MEASUREMENT_CHAR_UUID) {
            // Store the characteristic handle
            ble_data.received_characteristic_handle = evt->data.evt_gatt_characteristic.characteristic;
              }
          }


  break;


  case sl_bt_evt_gatt_characteristic_value_id:
    displayPrintf(DISPLAY_ROW_CONNECTION, "Handling Indications");
      if (evt->data.evt_gatt_characteristic_value.characteristic == ble_data.received_characteristic_handle) {
    // Convert received BLE data into temperature
      float temperature = FLOAT_TO_CELSIUS(evt->data.evt_gatt_characteristic_value.value.data);


      // Display the temperature with one decimal place
      displayPrintf(DISPLAY_ROW_TEMPVALUE, "Temp = %.1f ", temperature);


      // Send confirmation for indication
    sl_bt_gatt_send_characteristic_confirmation(ble_data.connection_handle);
      }

      if (evt->data.evt_gatt_characteristic_value.characteristic == gattdb_button_state) {
        if (evt->data.evt_gatt_characteristic_value.value.data[0]) {
                 displayPrintf(DISPLAY_ROW_9, "Button Pressed");
             } else {
                 displayPrintf(DISPLAY_ROW_9, "Button Released");
             }
         }
      break;

  case sl_bt_evt_connection_closed_id:

    displayPrintf(DISPLAY_ROW_CONNECTION, "Discovering");
    displayPrintf(DISPLAY_ROW_TEMPVALUE, " ");
    displayPrintf(DISPLAY_ROW_BTADDR2, " ");


      ble_data.connection_handle = 0;

      // Restart scanning
      sc = sl_bt_scanner_start(sl_bt_gap_phy_1m, sl_bt_scanner_discover_generic);

      if (sc != SL_STATUS_OK) {
          LOG_ERROR("Failed to restart scanning, error: 0x%04X\n", sc);
      }
      sl_bt_sm_delete_bondings();
                 sl_bt_scanner_start(sl_bt_gap_phy_1m, sl_bt_scanner_discover_generic);
      break;
  case sl_bt_evt_system_soft_timer_id:
        displayUpdate();
        break;
  default:
      break;
}
#endif
}
/**
 * @brief Computes the next pointer position in the circular buffer.
 *
 * This function calculates the next pointer index in a circular buffer.
 *
 * @param ptr Current pointer index.
 * @return Next pointer index in the circular buffer.
 */

