Bhavya-Saravanan/BLE-Firmware-EFR32BG/src/ble.c
static uint32_t nextPtr(uint32_t ptr)
{
    return (ptr + 1) % QUEUE_DEPTH;
}

/**
 * @brief Adds a data entry to the BLE transmission queue.
 *
 * This function inserts a new BLE data entry into a circular buffer
 * for processing indications.
 *
 * @param charHandle Characteristic handle for the data.
 * @param bufLength Length of the data buffer.
 * @param buffer Pointer to the data buffer.
 * @return `false` on success, `true` if queue is full or invalid input.
 */

bool write_queue(uint16_t charHandle, uint32_t bufLength, uint8_t *buffer)
{
    if (buffer == NULL || bufLength == 0 || bufLength > MAX_BUFFER_LENGTH) {
        return true;  // Invalid input
    }

    if (wptr == rptr && isflag) {
        return true;  // Queue full, cannot write
    }

    my_queue[wptr].charHandle = charHandle;
    my_queue[wptr].bufferLength = bufLength;
    memcpy(my_queue[wptr].buffer, buffer, bufLength);

    wptr = nextPtr(wptr);

    if (wptr == rptr) {
        isflag = true; // Queue is now full
    }

    return false;  // Successfully added to queue
}

/**
 * @brief Reads an indication from the circular buffer.
 *
 * Retrieves the next queued indication if available.
 *
 * @param charHandle Pointer to store characteristic handle.
 * @param bufLength Pointer to store buffer length.
 * @param buffer Pointer to store read data.
 * @return True if queue is empty, false otherwise.
 */

bool read_queue(uint16_t *charHandle, uint32_t *bufLength, uint8_t *buffer)
{
    if (charHandle == NULL || bufLength == NULL || buffer == NULL) {
        return true;
    }

    if (wptr == rptr && !isflag) {
        return true;  // Queue empty, cannot read
    }

    *charHandle = my_queue[rptr].charHandle;
    *bufLength = my_queue[rptr].bufferLength;
    memcpy(buffer, my_queue[rptr].buffer, *bufLength);

    rptr = nextPtr(rptr);
    isflag = false; // Since we removed an entry, queue cannot be full

    return false;  // Successfully read from queue
}

/**
 * @brief     Retrieves the number of elements currently in the BLE transmission queue.
 *
 * This function calculates the number of data entries currently present
 * in the circular buffer queue. It checks whether the queue is full,
 * empty, or partially filled, and returns the corresponding depth.
 *
 * @param     None
 * @return    uint32_t - The number of elements in the queue.
 */

uint32_t get_queue_depth()
{
    if (isflag) return QUEUE_DEPTH;
    if (wptr == rptr) return 0;
    return (wptr > rptr) ? (wptr - rptr) : (QUEUE_DEPTH - rptr + wptr);
}
/**
 * @brief Resets the BLE transmission queue.
 *
 * This function resets the circular buffer queue by setting the write pointer (`wptr`)
 * and read pointer (`rptr`) to zero and clearing the full-queue flag (`isflag`).
 * It ensures that the queue is empty and ready for new entries.
 *
 * @param None
 * @return None
 */
void reset_queue (void)
{
  wptr = 0;
  rptr = 0;
  isflag = false;

} // reset_queue()
/**
 * @brief Processes queued BLE indications and sends them.
 *
 * Reads queued indications and sends them if no indication is currently in flight.
 *
 * @return None
 */

void process_indications()
{
    if (!ble_data.indication_in_flight && get_queue_depth() > 0) {
        uint16_t charHandle;
        uint32_t bufLength;
        uint8_t buffer[MAX_BUFFER_LENGTH];

        if (!read_queue(&charHandle, &bufLength, buffer)) {
            sl_status_t status = sl_bt_gatt_server_send_indication(
                ble_data.connection_handle,
                charHandle,
                bufLength,
                buffer
            );

            if (status == SL_STATUS_OK) {
                pb0_indication_in_flight = true;  // Mark indication as in-flight
            }
        }
    }
}



